## Описание
1. Сделать конфигурационный файл, содержащий список строительных проектов. Каждый проект содержит следующие поля:
  - id
  - названия
  - географическая ширина и долгота
  - класс жилья (эконом, комфорт, премиум)
  - сумма стоимости всех квартир
  - количество квартир
2. Отрисовать границы административных районов по прикреплённому geojson (administrative.geojson)
3. Отображать на карте проекты в виде столбиков, где высота столбца соответствует сумме стоимости или количеству квартир в зависимости от выбранного тумблера. На вершине столбика отображается текущее значение суммы или количества.
4. Столбики должны окрашиваться в один из 3х цветов, в зависимости от класса жилья проекта
5. В UI предусмотреть тумблер переключения отображаемых значений: стоимость или количество.
6. В UI добавить группу тоглов с классами жилья и отображать только проекты с выбранными классами жилья
7. При наведение на столбик должно отображаться название проекта.


## Ограничения и допущения
  - Для демонстрации нужно добавить в конфиг минимум 10 проектов.
  - При анализе тестового задания будет уделяться внимание архитектуре проекта и возможности расширения функционала. 
  - Визуальная составляющая не важна, но все данные должны легко читаться. Плавные переходы приветствуются, но необязательны.
  - Допускается использовать любые сторонние библиотеки распространяемые под свободной лицензией. Не допускается использовать платные инструменты.
 
## Требования
  - Проект должен быть выложен на GitHub для проверки
  - Проект должен запускаться на Unity 2018.4+
  - Проект должен быть написан на языке программирования C#.
  - Все сторонние библиотеки и ресурсы должны хранится внутри проекта.
  - Проект должен собираться на одну из платформ macOS/Windows/iOS/Android
